# Python for Data Science & Analysis 
## Notes 3.1, Exploratory Data Analysis & Pandas

## Objectives
* describe a standard EDA workflow
* EXTRA: describe a standard communication & reporting process
* write a program which uses pandas to:
    * obtain a subset of columns using list indexes
    * obtain a subset of rows using locator syntax  
    * obtain descriptive statistics 
    * applies a test to a column to discretize it
    * factor a continuous column with a discrete column
* write a program which uses seaborn and matplotlib to:
    * show univariate plots (eg., distplot)
    * show multivariate plots (eg., scatterplot)
    * EXTRA: customize plots

# Part 1: What is EDA?

## What is Exploratory Data Analysis?

* goal:
    * investigate
    * explain
    * describe
    * understand

* questions?
    * data quality:
        * is there enough data?
        * is the data correct?
    * explanation:
        * what is the distribution of each column?
        * how do the columns correlate?

* method
    * primarily:
        * visual
        * descriptive
    * secondarily:
        * inference
            * eg., Linear Regression

## What are the tools for EDA in Python?

Simple pair: Pandas for data exploration, seaborn for visualization.


...but lots of options.

## What are the challenges around EDA?

Suppose you've been tasked with an exploratory project. This may fail, or otherwise be difficult, for lots of reasons.

### Challenges of EDA:

* Problem
* Organizational
    * Governance
* Technical 
* Psychological

* psychological
    * any scientific method is disagreeable
        * insensitive to social expectations 
        * results may conflict with assumptions
* problem
    * not enough data to solve the problems 
    * a (significant) majority of problems cannot be solved due to lack of data
* technical
    * consistent data entry  (M, F)
    * consistent experimental design / method
        * eg., consistent grouping, measurement scales, ...
    * predictability in measurmenets, target of study
        * essentially a lack of information
* organizational
    * HIPPO
        * highest paid persons opinion
    * silos
    * gate-keeping
        * data hoarding (power, job security, ...)
    * governance rules
    * internal hierachy changing
        * opaque lines of responsibility and access

### Problem 

* what is the question?
* what are the metrics for evaluating success?
* does the project deliver on valuable objectives?
* how long will it take?
* how much will it cost?
* do we have permission to access data? 
* is it legal to access the data?

### Challenges of EDA:

* Strategic 
* Organizational
* Technical

### Organizational

* is the data (socially) accessible? 
    * does governance/law permit access?
    * gate keeping
* where is the data?

### Challenges of EDA:

* Strategic 
* Organizational
* Technical

### Technical 

* Are there different conventions across datasets?
* Is data duplicated?
* Is data formatted for analysis?
    * eg., quantative data stored/represented as text
* Do our database tools provide efficient access to data?
* Does the data contain enough information for analysis?
    * Are the columns (ie., variables) sufficient?
* Do our tools save and **forget** data according to strategic needs?
    * eg., jupyter saves data in metadata, should this be removed?
* do we have the means to access?
    * eg., it's on the cloud vs. on-prem

## What is a standard *Technical* EDA workflow?

<font color=red>(...assuming the above challenges are overcome...)</font>

### The Ideal Method

There is NO single method for EDA ...

... in the sense that ideally we want a comprehensive understanding of the data, but understanding is domain specific; and data is domain specific. So methods need to be particular, specific and creative -- in order to uncover patterns of interest.

### Non-Ideal Method

#### Summary of Method
0. data quality, structure, etc. metrics
0. descriptive stats (& visuals) for all single columns
0. descriptive stats (& visuals) for all pairs of columns
0. domain-specific row subsets (ie., filters, WHERE)
0. introduce factoring columns (groupbys)
0. introduce domain-specific novel columns (derived from existing)
0. lightweight predictive modelling   (eg., linear regression)
0. domain-specific visuals (eg., geoplots)

It is important to be systematic with exploratory analysis, eg., if you omit analysis of single-columns and go straight to, eg., regression, it would be easy to misinterpret the regression.

### Non-Ideal Method

#### Summary of Method
* data quality, structure, etc. metrics
    * `.info()`
* descriptive stats for all single columns
* descriptive stats for all pairs of columns
    * ie., correlation
* domain-specific row subsets
    * all single cols, all pairs 
* introduce factoring columns
    * ie., groupby
    * factor all single columns
* introduce domain-specific novel columns
    * eg., bmi from w/h^2
* domain-specific visuals
    * eg., geo-plotting for geo data
* lightweight predictive modelling
    * eg., linear regression, etc.

#### Technical EDA

* Step 0. Show all key data quality metrics (mostly non-statistical, quality checks)
* Step 1. Plot all univariate (single-columns) distributions
* Step 2. Plot all plausible group'd (factored or groupby) univariate distribtions
* Step 3. Show all multivariate (multi-column, correlation) descriptive statistics
* Step 4. Plot all multivariate distributions
* Step 5a. Introduce more domain-specific querying
* Step 5b. Introduce facotoring columns (derived columns for groupby)
* Step 5c. (Maybe:) Derived continuous columns 
* Step 6. (Maybe:) Introduce novel domain-specific visualizations
* Step 7. Lightweight Stat Modelling

#### Technical EDA

* Step 0. Show all key data quality metrics (mostly non-statistical, quality checks)
    * missing data, descriptive stats of all columns...
* Step 1. Plot all univariate (single-columns) distributions
    * `.describe()`
    * eg., `sns.distplot` for *all* single columns
* Step 2. Plot all plausible group'd (factored or groupby) univariate distribtions
    * ie., subset rows of a single column (based on something domain specific)
    * plot distributions of those
* Step 3. Show all multivariate (multi-column, correlation) descriptive statistics
    * correlation coefs between all pairs of columns, etc.
* Step 4. Plot all multivariate distributions
    * eg., start with linear regression for all pairs of variables
    * eg., group contintous columns by discrete columns
* Step 5a. Introduce more domain-specific querying
    * ie., domain-specific `WHERE` conditions
    * subset rows and repeat (0 - 4)
    * subset columns and rows and repeat (0 - 4)
* Step 5b. Introduce facotoring columns (derived columns for groupby)
    * aka. enrichment, feature engineering (aka. adding a column)
    * grouping an exsiting real-number column by meaningful categories
        * eg., young, old, etc.
    * then use this col on others
    * this captures higher-level (heirachical) patterns
* Step 5c. (Maybe:) Derived continuous columns 
    * eg., bmi from weight/height
    * plots, etc.
* Step 6. (Maybe:) Introduce novel domain-specific visualizations
    * eg., geo maps, techincal heatmaps, ...
* Step 7. Lightweight Stat Modelling
    * linear regression = regression (continuous)
        * simple trend prediction
    * logistic regression = classification (discete)
        * sorting data points into groups (labels/classes/etc.)

# Part 2: EDA with Pandas

In [1]:
import pandas as pd

df = pd.read_csv('datasets/titanic.csv')

## How do we EDA with Pandas?

* data quality, structure, etc. metrics
    * $\rightarrow$ `.info()`
* descriptive stats for all single columns
    * $\rightarrow$ `.describe()`, `.mean()`, `.value_counts()`
* descriptive stats for all pairs of columns
    * $\rightarrow$ `.corr()`
* domain-specific row subsets
    * $\rightarrow$ `df.loc`
* introduce factoring columns 
    * $\rightarrow$ `.groupby`
* introduce domain-specific novel columns
    * $\rightarrow$ `df['bmi'] = df['w'] / df['h'] ** 2`
* domain-specific visuals
    * $\rightarrow$ `df.plot`

## How do I understand the structure of a dataset?

In [2]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    object
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    object
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), float64(2), int64(4), object(7)
memory usage: 92.4+ KB

## How do I find possible relations between columns?

The purpose of computing a correlation score (default: pearson) is to determine *possible* relationships, rather than accurately measure correlation.

Note the *sign* of the score, and it's rough magnitude. You should plot all columns and pairs *regardless*.

In [4]:
df.corr()

,survived,pclass,age,sibsp,parch,fare,adult_male,alone
survived,1.000000,-0.338481,-0.077221,-0.035322,0.081629,0.257307,-0.557080,-0.203367
pclass,-0.338481,1.000000,-0.369226,0.083081,0.018443,-0.549500,0.094035,0.135207
age,-0.077221,-0.369226,1.000000,-0.308247,-0.189119,0.096067,0.280328,0.198270
sibsp,-0.035322,0.083081,-0.308247,1.000000,0.414838,0.159651,-0.253586,-0.584471
parch,0.081629,0.018443,-0.189119,0.414838,1.000000,0.216225,-0.349943,-0.583398
fare,0.257307,-0.549500,0.096067,0.159651,0.216225,1.000000,-0.182024,-0.271832
adult_male,-0.557080,0.094035,0.280328,-0.253586,-0.349943,-0.182024,1.000000,0.404744
alone,-0.203367,0.135207,0.198270,-0.584471,-0.583398,-0.271832,0.404744,1.000000

A score of $1$ means that the two columns *contain the same information*. $0$ means they are *random* with respect each other (ie., no predictiability between them). Numbers outside these suggest some level of shared information between columns.

We are interested in the sign & magnitude of these entires... above, we can see: strong negative between survived and pclass (class 1 $\rightarrow$ 3, survival).

Aside: the options are

* pearson : standard correlation coefficient (measure of "straight line-ness" of the data")
* kendall : Kendall Tau correlation coefficient
* spearman : Spearman rank correlation

## How do I select columns from a dataframe?

In [5]:
df['age']

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: age, Length: 891, dtype: float64

In [6]:
df[ ['age', 'fare'] ]

      age     fare
0    22.0   7.2500
1    38.0  71.2833
2    26.0   7.9250
3    35.0  53.1000
4    35.0   8.0500
..    ...      ...
886  27.0  13.0000
887  19.0  30.0000
888   NaN  23.4500
889  26.0  30.0000
890  32.0   7.7500

[891 rows x 2 columns]

## How do I select rows from a dataframe?

If you wish to obtain a subset of rows, you should use `.loc` ("locate").


We use `df.loc` to locate rows,

`df.loc[  row-indexs,  column-names ]`

In [7]:
df.loc[0, 'age'] # SELECT age FROM df WHERE rowid = 0

22.0

In [10]:
df.loc[0:5, ['age', 'fare']]

    age     fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500
5   NaN   8.4583

In [11]:
df.loc[ [0, 10, 7], 'survived']

0     0
10    1
7     0
Name: survived, dtype: int64

In [14]:
df.loc[0, :]

survived                 0
pclass                   3
sex                   male
age                   22.0
sibsp                    1
parch                    0
fare                  7.25
embarked                 S
class                Third
who                    man
adult_male            True
deck                   NaN
embark_town    Southampton
alive                   no
alone                False
Name: 0, dtype: object

In [16]:
df.iloc[0, 0:10]

survived        0
pclass          3
sex          male
age          22.0
sibsp           1
parch           0
fare         7.25
embarked        S
class       Third
who           man
Name: 0, dtype: object

## How do I select rows on cleaned datasets?

Operations which modify the indexes of a datset (eg., by removing them), may produce suprising results when used with `.loc`:

In [ ]:
df.reset_index()

In [19]:
clean = df.dropna().reset_index(drop=True)
clean.loc[0:5, :]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
1,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
2,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
3,1,3,female,4.0,1,1,16.7000,S,Third,child,False,G,Southampton,yes,False
4,1,1,female,58.0,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True
5,1,2,male,34.0,0,0,13.0000,S,Second,man,True,D,Southampton,yes,True

We have dropped rows indexed `0, 2, ...`, so they don't show up.

In [20]:
df['age'].median()

28.0

## How does Pandas indexing differ from lists?

You cannot use negative indexes. Indexes refer to a *column* (the index column) not to a sequence position.

In [ ]:
data = [1, 2, 3]
data[-2:]

In [ ]:
data[0:3]

## Exercise (30 min)

* create your own notebook, and with the `titanic` dataset 

* building on any prior solutions...
    * compute *and* interpret
        * .info()
        * provide comments which describe the data quality based on `.info()`
    * descriptive stats for all single columns
        * .mean(), .median(), .std(), .value_counts()
      
* descriptive stats for all pairs of columns
    * .corr()
    * interpret & provide comments around which columns show association
    * what columns "make sense" correlated? can you explain why?
* select the first five rows (not using `head`) for:
    * all columns
    * age column
    * age and fare columns
    * select rows `[0, 3, 5]`
    * select the last five rows:
        * HINTS: the last row has an index of `len(df)`
            * `len(df) - 5 : len(df)`
        * HINTS: `:` means "all"
            * from the beginning to the end

# Part 3: Advanced Querying

## How do I use comparison operators to filter rows?

If we want a subset of rows, we should use `df.loc`...

Let's look at an example before explaining how it works...

In [23]:
df['fare'] > 100

0      False
1      False
2      False
3      False
4      False
       ...
886    False
887    False
888    False
889    False
890    False
Name: fare, Length: 891, dtype: bool

In [24]:
query = df['survived'] == 1

df.loc[  query ,  'fare'  ].mean(),  df.loc[ ~query, 'fare'].mean()

(48.39540760233917, 22.117886885245877)

The query is a *comparison* across every entry in the `survived` column which yield a `True` or a `False`:

In [22]:
query

0      False
1       True
2       True
3       True
4      False
       ...
886    False
887     True
888    False
889     True
890    False
Name: survived, Length: 891, dtype: bool

When used as a filter, a boolean column such as `query`, selects the indexes of the rows which are `True`.

In [25]:
query_index = [1, 2, 3, 887, 889]

When we use that query as an index, the rows corresponding to the `True` values are selected:

In [26]:
df.loc[ df['fare'] >= 500 , 'age']

258    35.0
679    36.0
737    35.0
Name: age, dtype: float64

When using a comparison as index, pandas will run the comparison over every row and *keep the row indexes* where the comparison comes out `True`.

## What are the standard comparison operators?

* `==` is equal to
* `!=` is not equal to
* `>` is greater than
* `<`
* `>=` is greater than or equal to
* `<=` 
* `df.isin(set)` rows are in `set`
* EXTRA:
    * pandas has a wide variety of other comparison operators
    * eg., `df['embark_town'].str.contains('*town')`
        * "which `embark_town` end in `town` ?"

### Example

Locate the rows where the class is "in" `{First, Third}`, select the fare column, take the average.


`SELECT mean(fare) FROM df WHERE class IN ("First", "Third")`

In [27]:
df.loc[  
       df['class'].isin(['First', 'Third'])  # row index filter
    , 'fare'                                 # columns
].mean() # query

35.20807298444123

Average `fare` for second and third class passengers:

In [28]:
df.loc[  df['class'] != 'First', 'fare'].mean()

15.580054518518512

EXTRA:

In [ ]:
df.value_counts()

In [41]:
df['embark_town'].str.contains('tow?n').value_counts(dropna=False)

True     721
False    168
NaN        2
Name: embark_town, dtype: int64

In [46]:
df.head(5)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [47]:
df.loc[~df['embark_town'].isna()].loc[df['embark_town'].str.contains('[QC]').dropna()]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False
16,0,3,male,2.0,4,1,29.1250,Q,Third,child,False,NaN,Queenstown,no,False
19,1,3,female,NaN,0,0,7.2250,C,Third,woman,False,NaN,Cherbourg,yes,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
875,1,3,female,15.0,0,0,7.2250,C,Third,child,False,NaN,Cherbourg,yes,True
879,1,1,female,56.0,0,1,83.1583,C,First,woman,False,C,Cherbourg,yes,False
885,0,3,female,39.0,0,5,29.1250,Q,Third,woman,False,NaN,Queenstown,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

Regular Expressions

## How do I combine comparisons?

In python, the logical operators are `and`, `or`, `not`... these do not work with pandas (, and many other data process libraries).

These are not designed to work *across* a dataset; ie., down columns: to use this way, you'd need to loop.

In [48]:
("@" not in "mburgess@qa.com") and (len("M") == 1) or ("London".isalpha())

True

We must always bracket comparison before combining them (if there is only one, it is optional)...

#### `&` $\equiv$ AND

In [49]:
(df['age'] <= 50) & (df['survived'] == 1)

0      False
1       True
2       True
3       True
4      False
       ...
886    False
887     True
888    False
889     True
890    False
Length: 891, dtype: bool

In [50]:
df.loc[ 
      (df['age'] >= 50) & (df['survived'] == 1) # row index filter
    , 'fare'                                    # selecting columns
].mean() # query

65.58441111111112

### `|` $\equiv$ OR

In [51]:
(df['age'] >= 50) | (df['survived'] == 1)

0      False
1       True
2       True
3       True
4      False
       ...
886    False
887     True
888    False
889     True
890    False
Length: 891, dtype: bool

In [52]:
df.loc[ (df['age'] >= 50) | (df['fare'] >= 100), 'survived'].mean()

0.5166666666666667

### `~` $\equiv$ NOT

In [56]:
~df['fare'].isna()

0      True
1      True
2      True
3      True
4      True
       ...
886    True
887    True
888    True
889    True
890    True
Name: fare, Length: 891, dtype: bool

In [ ]:
~((df['age'] >= 50) | (df['fare'] >= 100))

In [ ]:
df.loc[ ~((df['age'] >= 50) | (df['fare'] >= 100)), 'survived'].mean()

## How do I compute the frequency of matches?

A mean across a column of booleans (ie., a comparison) counts `True` as `1` and therefore counts the frequency of rows which match the comparison.

In [57]:
((df['age'] >= 50) | (df['fare'] >= 100)).mean()

0.13468013468013468

In [58]:
results = [True, True, False, True]

sum(results)/len(results)

0.75

## How do I group and aggregate data?

```python
df['column-to-be-aggregated'].groupby(
    df['values-to-split-on']
).summaryfn()
```

* `SELECT age FROM df GROUP BY survived`
* `SELECT age FROM df GROUP BY survived, class`
* `SELECT age FROM df WHERE age <= 18 GROUP BY survived, class`

What is the average age of the Titanic passengers?

In [68]:
df.groupby(['survived', 'class']).mean()

                 pclass        age     sibsp     parch       fare  adult_male  \
survived class
0        First      1.0  43.695312  0.287500  0.300000  64.684007    0.962500
         Second     2.0  33.544444  0.319588  0.144330  19.412328    0.938144
         Third      3.0  26.555556  0.672043  0.384409  13.669364    0.755376
1        First      1.0  35.368197  0.492647  0.389706  95.608029    0.308824
         Second     2.0  25.901566  0.494253  0.643678  22.055700    0.091954
         Third      3.0  20.646118  0.436975  0.420168  13.694887    0.319328

                    alone
survived class
0        First   0.637500
         Second  0.701031
         Third   0.685484
1        First   0.426471
         Second  0.413793
         Third   0.579832

In [70]:
df.groupby(['survived']).count()['age']

survived
0    424
1    290
Name: age, dtype: int64

```
df['column-to-be-aggregated'].groupby(
    df['values-to-split-on']
).aggregationfn()
```

* `SELECT age FROM df GROUP BY survived`
* `SELECT age FROM df GROUP BY survived, class`
* `SELECT age FROM df WHERE age <= 18 GROUP BY survived, class`

## Aside: In sumary..


* `&` and
* `|` or
* `~` not

## How I groupby multiple columns?

In [ ]:
df['fare'].groupby([df['survived'], df['class']]).mean()

```
df['column-to-be-aggregated'].groupby(
    df['values-to-split-on']
).aggregationfn()
```

* `SELECT age FROM df GROUP BY survived`
* `SELECT age FROM df GROUP BY survived, class`
* `SELECT age FROM df WHERE age <= 18 GROUP BY survived, class`

## Exercise (10 min)

* find the rates of survival for different age groups
    * `.loc[ ... , 'age']`
    * `df['age'] <= 18`
    * ` (df['age'] < ...) & (df['age'] > ...)`
* analyse survival by group on 
    * class, adult_male, ...
    * `.groupby`
    * what column is most predictive of survival, why?
* consider addition comparisons (eg., using `|`, `~`)...
* EXTRA: particularly:
    * browse pandas documentation for additional comparison operators and approaches
    * explore and expand your analysis of:
    * age, fare, locations, class, deck, alone
        * and their impact on survival
    * ie., try different filters on these

In [72]:
df.groupby(df['age'] > 16) & (df['sex'] == 'male')).mean()['survived']

False    0.554192
True     0.176617
Name: survived, dtype: float64

In [76]:
df.groupby(['survived', 'sex']).

                 pclass  age  sibsp  parch  fare  embarked  class  who  \
survived sex
0        female      81   64     81     81    81        81     81   81
         male       468  360    468    468   468       468    468  468
1        female     233  197    233    233   233       231    233  233
         male       109   93    109    109   109       109    109  109

                 adult_male  deck  embark_town  alive  alone
survived sex
0        female          81     6           81     81     81
         male           468    61          468    468    468
1        female         233    91          231    233    233
         male           109    45          109    109    109

In [75]:
(df.loc[(df['age'] > 16) & (df['sex'] == 'male') & (df['survived'] == 1), :].shape[0]/df.shape[0])

0.07968574635241302